/*****************************************************************************
 * (C) Copyright PMC - WIN division (Wintegra) 2011.  All rights reserved.
 * PMC-Sierra (WINTEGRA) CONFIDENTIAL PROPRIETARY
 * Contains Confidential Proprietary information of PMC-Sierra (Wintegra).
 * Reverse engineering is prohibited.
 * The copyright notice does not imply publication.
 ****************************************************************************/

//////////////////////////////////////////////////////////////
//                                                          //
// the int ram partition change function - implementation   //
//                                                          //
//////////////////////////////////////////////////////////////

#include "include/core/registry/wpi_registry.h"
#include "hardware/hal_if/wpi_hal_device_executor.h"

#ifdef WP_HW_WINPATH3
#include "include/core/hardware/wpi_hw_pce.h"
#endif


/******** re-defined here the CFU RIF reference *******/
#if WP_HW_WINPATH3
#define WPI_CFU_RX(base) (wpi_hw_cfu_rx*)((base) + WPI_CFU_RX_BASE)

#define WT_CFU_RX_BUFFERS_NUM_IN_CFU_BLOCK       4096


/*---------------------- WMM registers -----------------------*/
typedef struct
{
        WPI_PTR fifo_start[48];
        WP_U32 pad_0[16];
        WPI_PTR fifo_end[48];
        WP_U32 pad_1[16];
        WPI_PTR fifo_counter[48];
        WP_U32 pad_2[16];
        WPI_PTR fifo_max[48];
        WP_U32 pad_3[16];
        WPI_PTR iq_start[4];
        WPI_PTR iq_temp[4];
        WPI_PTR iq_end[4];
        WP_U32 lar;
        WP_U32 utar;
        WP_U32 gmr;
        WP_U32 ios;
        WP_U32 fer[2];
        WP_U32 ffr[2];
        WP_U32 hcr_reg;
        WPI_PTR hcr_addr;
        WP_U32 hcr_cmd;
        WP_U32 rwm;
        WP_U32 pad_4[16];
        WP_U32 dbf_8_15_base[8];
        WP_U32 pad_5[8];
        WP_U32 dbf_8_15_offset[8];
        WP_U32 ae_low;
        WP_U32 ae_hi;
} wt_wmm;

/*----------------------- fuse registers --------------------*/
#define WT_HW_WINPATH_DEVICE_ID_S          19
#define WT_HW_WINPATH_DEVICE_ID_W          8

#define WT_HW_WINPATH_REV_ID_S             27
#define WT_HW_WINPATH_REV_ID_W             4

#define WT_HW_WINPATH_SUB_REV_ID_LSB_S     31
#define WT_HW_WINPATH_SUB_REV_ID_LSB_W     1

#define WT_HW_WINPATH_SUB_REV_ID_MSB_S     0
#define WT_HW_WINPATH_SUB_REV_ID_MSB_W     3

typedef struct
{
        WP_U32 reg0;
        WP_U32 reg1;
} wt_fuse_reg;

/*---------------------- int ram partition ------------------*/
#define WT_SIU_INT_REG_RAM_CFG_MIPS_S 0
#define WT_SIU_INT_REG_RAM_CFG_MIPS_W 3

#define WT_SIU_INT_REG_RAM_CFG_PCE_TOP_S 4
#define WT_SIU_INT_REG_RAM_CFG_PCE_TOP_W 4

#define WT_SIU_INT_REG_RAM_CFG_PCE_HASH_S 12
#define WT_SIU_INT_REG_RAM_CFG_PCE_HASH_W 1

#define WT_SIU_INT_REG_RAM_CFG_CFU_TX_S 16
#define WT_SIU_INT_REG_RAM_CFG_CFU_TX_W 3

#define WT_SIU_INT_REG_RAM_CFG_POLICER_S 20
#define WT_SIU_INT_REG_RAM_CFG_POLICER_W 2

#define WT_SIU_INT_REG_RAM_CFG_CFU_RX_S 24
#define WT_SIU_INT_REG_RAM_CFG_CFU_RX_W 2

typedef struct
{
        WP_U32 addr_start;
        WP_U32 addr_size;
        WP_U32 pad[0x7];
        WP_VU32 hbm;
        WP_VU32 tear;
        WP_VU32 tesr;
        WP_VU32 hbms1;
        WP_VU32 hbms2;
        WP_U32  pad1;
        WP_VU32 ram_config;
} wt_siu_internal;
#endif

#if WP_HW_WINPATH4

//#include "include/core/hardware/wpi_bases.h"
//#include "hardware/winpath4/wpi_hw_cfu_int.h"

#define WT_CFU_RX_BUFFERS_NUM_IN_CFU_BLOCK       4096

#define WT_SIU_INT_REG_RAM_CFG_MIPS_S 0
#define WT_SIU_INT_REG_RAM_CFG_MIPS_W 2

#define WT_SIU_INT_REG_RAM_CFG_PCE_TOP_S 4
#define WT_SIU_INT_REG_RAM_CFG_PCE_TOP_W 5

#define WT_SIU_INT_REG_RAM_CFG_CFU_TX_S 16
#define WT_SIU_INT_REG_RAM_CFG_CFU_TX_W 3

#define WT_SIU_INT_REG_RAM_CFG_POLICER_S 20
#define WT_SIU_INT_REG_RAM_CFG_POLICER_W 2

#define WT_SIU_INT_REG_RAM_CFG_CFU_RX_S 24
#define WT_SIU_INT_REG_RAM_CFG_CFU_RX_W 2

#define WPI_CFU_RX(base) (wpi_hw_cfu_rx*)((base) + WPI_CFU_RX_BASE)

typedef struct
{
        WP_VU32 addr_start;
        WP_VU32 addr_size;
        WP_VU32 reg_config;
        WP_VU32 abr_config_0;
        WP_VU32 pad[10];
        WP_VU32 abr_config_1;
        WP_VU32 ram_config;
} wt_siu_internal;

#define WPI_FIFO_MAX_N 24

typedef struct
{
        WPI_PTR fifo_start[WPI_FIFO_MAX_N]; // 0-95
        WP_U32 pad_0[8]; // 96-127
        WPI_PTR fifo_end[WPI_FIFO_MAX_N]; // 128-223
        WP_U32 pad_1[8]; // 224-255
        WPI_PTR fifo_counter[WPI_FIFO_MAX_N]; // 256-351
        WP_U32 pad_2[8]; // 352-383
        WPI_PTR fifo_max[WPI_FIFO_MAX_N]; // 384-479
        WP_U32 pad_3[40]; // 480-639
        WPI_PTR iq_start[4]; // 640-655
        WPI_PTR iq_temp[4]; // 656-671
        WPI_PTR iq_end[4]; // 672-687
        WP_U32 pad_4[20]; // 688-767
        WP_U32 lar; // 768-771
        WP_U32 utar; // 772-775
        WP_U32 pad_5[2]; // 776-783
        WP_U32 fer; // 784-787
        WP_U32 ffr; // 788-791
        WP_U32 pad_6[2]; // 792-799
        WP_U32 hcr_reg; // 800-803
        WPI_PTR hcr_addr; // 804-807
        WP_U32 hcr_cmd; // 808-811
        WP_U32 pad_7[21]; // 812-895
        WP_U32 dbf_8_15_base[8]; // 896-927
        WP_U32 dbf_8_15_offset[8]; // 928-959
        WP_U32 ae_low; // 960-963
        WP_U32 ae_hi; // 964-967
        WP_U32 gmr; // 968-971
        WP_U32 ios; // 972-975
        WP_U32 pad_8[12]; // 976-1023
} wt_wmm;
#endif


//////////////////////////////////////////////////////////////
//                     int ram ecc initialize               //
//////////////////////////////////////////////////////////////
#define HOST_WRITE_CMD_OP        0xd0100000
#define HOST_READ_CMD_OP         0xc8100000
#define HOST_CMD_WRITE_SIZE      0x400

/***********************************************
 * writeTrs
 ***********************************************/

static WP_U32 writeTrs( WP_U32 start_addr, WP_U32 size,
                        WP_U32 hcr_reg, WP_U32 hcr_cmd,
                        WP_U32 hcr_addr )
{
        WP_U32 addr, temp32;

        for( addr = start_addr; addr < start_addr+size; addr += HOST_CMD_WRITE_SIZE )
        {
                WPI_REG_SET(*((volatile WP_U32*)hcr_reg), 0);
                WPI_REG_SET(*((volatile WP_U32*)hcr_addr), addr);
                WPI_REG_SET(*((volatile WP_U32*)hcr_cmd), HOST_WRITE_CMD_OP);

                /*loop while host cmd valid bit is set:*/
                WPI_REG_GET(temp32, *((volatile WP_U32*)hcr_cmd));
                while((temp32 & 0x80000000))
                        WPI_REG_GET(temp32, *((volatile WP_U32*)hcr_cmd));
        }
        return 0;
}

/***********************************************
 * readTrs
 ***********************************************/

static WP_U32 readTrs( WP_U32 start_addr, WP_U32 size,
                       WP_U32 hcr_reg, WP_U32 hcr_cmd,
                       WP_U32 hcr_addr )
{
        WP_U32 addr, temp32;

        for( addr = start_addr; addr < start_addr+size; addr += HOST_CMD_WRITE_SIZE )
        {
                WPI_REG_SET(*((volatile WP_U32*)hcr_reg), 0);
                WPI_REG_SET(*((volatile WP_U32*)hcr_addr), addr);
                WPI_REG_SET(*((volatile WP_U32*)hcr_cmd), HOST_READ_CMD_OP);

                /*loop while host cmd valid bit is set:*/
                WPI_REG_GET(temp32, *((volatile WP_U32*)hcr_cmd));
                while((temp32 & 0x80000000))
                        WPI_REG_GET(temp32, *((volatile WP_U32*)hcr_cmd));
        }
        return 0;
}

/***********************************************
 * writeTrsOnInternalRam
 ***********************************************/
void WT_ReInitIntRam(WP_U32 wpid, WP_U8* reg_bases_ptr, wt_siu_internal *siu_internal)
{
#if !defined(WINSIM) && !defined(VERILOG)
        WP_U32 bus_base, bus_size, addr, host_offset;
        wpi_veneer_memory bus_mappings[WINPATH_NUM_MAX][WPI_BUS_LAST];
        wt_wmm *wmm;

        wmm = (wt_wmm *)WPI_WMM(reg_bases_ptr, 2);

        WPI_REG_GET(bus_base, siu_internal->addr_start);
        WPI_REG_GET(bus_size, siu_internal->addr_size);

        printf("Re-init INT RAM\n");
        //printf("START %08X SIZE %08X\n", bus_base, bus_size);

        //*(unsigned int*)MAP_SIU3_REG_CONFIG = 0x3 << 29;//enable ECC

        writeTrs( bus_base, HOST_CMD_WRITE_SIZE,
                  (WP_U32) &(wmm->hcr_reg), (WP_U32) &(wmm->hcr_cmd), (WP_U32) &(wmm->hcr_addr) );

        WPL_BusesMapGet(&(bus_mappings[0][0]));
        host_offset = (WP_U32) bus_mappings[wpid][WP_BUS_INTERNAL].uncached_offset;
        //printf("HOST OFFSET %08X\n", host_offset);

        for(addr = bus_base; addr < (bus_base+0x400); addr += 4)
        {
                WPI_MEM_SET(*((volatile WP_U32*)(addr+host_offset)), 0);
        }

        readTrs( bus_base, HOST_CMD_WRITE_SIZE,
                 (WP_U32) &(wmm->hcr_reg), (WP_U32) &(wmm->hcr_cmd), (WP_U32) &(wmm->hcr_addr) );

        writeTrs( bus_base+HOST_CMD_WRITE_SIZE, bus_size-HOST_CMD_WRITE_SIZE,
                  (WP_U32) &(wmm->hcr_reg), (WP_U32) &(wmm->hcr_cmd), (WP_U32) &(wmm->hcr_addr) );
#endif // !defined(WINSIM) && !defined(VERILOG)
}


#ifdef WP_HW_WINPATH3


/************************************************************************
 * Function:  WT_HwDeviceInfoGet
 *
 * Purpose:   get the winpath revision ID
 *
 * Description:
 *
 * Inputs:
 *
 * Outputs:
 *
 * Return Value: the winpath revision ID
 *
 * Called by:
 *
 ************************************************************************/
WP_U32 WT_HwDeviceInfoGet(WP_U32 wpid, WP_U8 *reg_bases_ptr)
{
        WP_U32 winpath_rev_id = 0;
//#if !defined(WINSIM) && !defined(VERILOG)
        wt_fuse_reg *fuse_regs;
        WP_U32 device_id, rev_id, sub_rev_id;
        WP_U32 reg0, reg1;

        winpath_rev_id = WPI_REV_ID;

        /* set the pce registers address */
        fuse_regs = (wt_fuse_reg *) (reg_bases_ptr + WPI_FUSE_BASE);
        WPI_REG_GET(reg0, fuse_regs->reg0);
        WPI_REG_GET(reg1, fuse_regs->reg1);

        device_id = WPI_NCM_VALUE(WT_HW_WINPATH_DEVICE_ID, reg0);
        rev_id = WPI_NCM_VALUE(WT_HW_WINPATH_REV_ID, reg0);
        sub_rev_id = WPI_NCM_VALUE(WT_HW_WINPATH_SUB_REV_ID_LSB, reg0) +
                (WPI_NCM_VALUE(WT_HW_WINPATH_SUB_REV_ID_MSB, reg1) << 1);

        //printf("device_id %d rev_id %d sub_rev_id %d\n", device_id, rev_id, sub_rev_id);

        switch(device_id)
        {
        case WPI_DEVICE_WP3:
                if(rev_id == WPI_REV_B)
                {
                        if(sub_rev_id == 1)
                                winpath_rev_id = WPI_WP_REV_3_B1;
                        else if(sub_rev_id == 2)
                                winpath_rev_id = WPI_WP_REV_3_B2;
                }
                break;
        case WPI_DEVICE_WP3_SL:
                winpath_rev_id = WPI_WP_REV_3_SLB;
                if(rev_id == WPI_REV_B)
                {
                        if(sub_rev_id == 0)
                                winpath_rev_id = WPI_WP_REV_3_SLB;
                        else if(sub_rev_id == 1)
                                winpath_rev_id = WPI_WP_REV_3_SLB1;
                }
                break;
        case WPI_DEVICE_WP3_SPO:
                winpath_rev_id = WPI_WP_REV_3_SPO;
                if(rev_id == WPI_REV_B)
                {
                        if(sub_rev_id == 1)
                                winpath_rev_id = WPI_WP_REV_3_SPO;
                }
                break;
        }

        switch(winpath_rev_id)
        {
        case WPI_WP_REV_3_SPO:
                printf("Chip Revision: WP3 SPO\n");
                break;
        case WPI_WP_REV_3_SLB:
                printf("Chip Revision: WP3 SL B\n");
                break;
        case WPI_WP_REV_3_SLB1:
                printf("Chip Revision: WP3 SL B.1\n");
                break;
        case WPI_WP_REV_3_A:
                printf("Chip Revision: WP3 Rev A\n");
                break;
        case WPI_WP_REV_3_B1:
                printf("Chip Revision: WP3 Rev B.1\n");
                break;
        case WPI_WP_REV_3_B2:
                printf("Chip Revision: WP3 Rev B.2\n");
                break;
        }
//#endif // !defined(WINSIM) && !defined(VERILOG)

        return winpath_rev_id;
}

#define HALI_PCE_HASH_BASIC_SIZE_BITS           10
#define HALI_PCE_HASH_BASIC_SIZE                (0x1 << HALI_PCE_HASH_BASIC_SIZE_BITS)
#define WPI_PCE_AR_MEM_UNIT_HASHR                      0x4  /* Hash RAM */

#define WPI_PCE_AR_ONE_WORD_MODE_OFF                   0
#define WPI_PCE_AR_ONE_WORD_MODE_S                     19 /*NEW RIF */
#define WPI_PCE_AR_ONE_WORD_MODE_W                     1

#define WPI_PCE_AR_ONE_WORD_MODE_RESET(reg)            WPI_NCM_SET_VAL(WPI_PCE_AR_ONE_WORD_MODE, reg, WPI_PCE_AR_ONE_WORD_MODE_OFF)

#define WPI_PCE_AR_MEM_UNIT_S                          20 /*NEW RIF */
#define WPI_PCE_AR_MEM_UNIT_W                          4

#define WPI_PCE_AR_HASH_ENTRY_S                        0
#define WPI_PCE_AR_HASH_ENTRY_W                        6

#define WPI_PCE_AR_HASH_LINE_S                         6
#define WPI_PCE_AR_HASH_LINE_W                         11 /*NEW RIF */

#define WPI_PCE_HASH_RAM_CRC_RES_S                     15
#define WPI_PCE_HASH_RAM_CRC_RES_W                     17

#define WPI_PCE_HASH_RAM_EXACT_MATCH_POINTER_S         0
#define WPI_PCE_HASH_RAM_EXACT_MATCH_POINTER_W         15

#define WPI_PCE_GFR_HASH_INIT_S                        15
#define WPI_PCE_GFR_HASH_INIT_W                        1

#define WPI_PCE_GFR_ECC_HASH_S                         14
#define WPI_PCE_GFR_ECC_HASH_W                         1

#define WPI_PCE_GFR_ECC_EM_S                           13
#define WPI_PCE_GFR_ECC_EM_W                           1

#define HALI_PCE_IND_DATA_REGS_NUM              9
#define HALI_PCE_UNUSED_REGS_NUM                (0x7D - 0x40)

typedef struct HALI_pce_regs
{
        WP_U32 dr[HALI_PCE_IND_DATA_REGS_NUM];
        /* 0x0-0xX-1 DR0-DRX (indirect data registers)
           X is HALI_PCE_IND_DATA_REGS_NUM */
        WP_U32 dummy1[0x2E - HALI_PCE_IND_DATA_REGS_NUM];
        /* 0xX-0x2E is not used currently
           X is HALI_PCE_IND_DATA_REGS_NUM */
        WP_U32 sa[5];              /* 0xb8 search accelerator registers */
        WP_U32 pu_cnt;             /* 0xcc parse utilization counter */
        WP_U32 cu_cnt;             /* 0xd0 classifier utilization counter */
        WP_U32 hae_cnt;            /* 0xd4 header access error counter */
        WP_U32 pt_cnt;             /* 0xd8 parser timeouts' counter */
        WP_U32 ct_cnt;             /* 0xdc classifier timeouts' counter */
        WP_U32 pa_cnt;             /* 0xe0 parser accept counter */
        WP_U32 seed_reg;           /* 0xe4 seed register */
        WP_U32 gfr;                /* 0xe8 GFR (global flags register) */
        WP_U32 hfr_mp0;            /* 0xec HFR_MP0 */
        WP_U32 hfr_mp1;            /* 0xf0 HFR_MP1 */
        WP_U32 slr0;               /* 0xf4 SLR0 (system limits register)  */
        WP_U32 slr1;               /* 0xf8 SLR1 (system limits register)  */
        WP_U32 ar;                 /* 0xfc AR (indirect address register) */
        WP_U32 dummy2[HALI_PCE_UNUSED_REGS_NUM];/* 0x100-0x1F0 is not used currently */
        WP_U32 mpdr;               /* 0x1F4 MPDR (mask priority drop register) */
        WP_U32 mdr;                /* 0x1F8 MDR (mask deny register) */
}HALI_pce_regs;

/*****************************************************************************
 *
 * Function:   WPI_PceGfrEccSet
 *
 * Purpose:    enable/disable the PCE ECC in both Hash and Exact match
 *
 *
 * Description:
 *
 * Inputs:
 *             pce_regs            pointer to the pce rif
 *             enable              0 - disable, 1 - enable
 *
 * Outputs:
 *
 * Return Value:
 *             WP_OK
 * Called by:
 *
 ****************************************************************************/
WP_status WTI_PceGfrEccSet(HALI_pce_regs *pce_regs, WP_U8 enable)
{
        WP_U32 temp32;

        WPI_REG_GET(temp32, pce_regs->gfr);

        WPI_NCM_SET_VAL(WPI_PCE_GFR_ECC_HASH, temp32, enable);
        WPI_NCM_SET_VAL(WPI_PCE_GFR_ECC_EM, temp32, enable);

        WPI_REG_SET(pce_regs->gfr, temp32);

        return WP_OK;
}

WP_status WTI_PceGfrHashInit(HALI_pce_regs *pce_regs, WP_U8 enable)
{
